Scala.org
#+FILETAGS: :vimwiki:

* Scala
#= Scala =

[[Akka]]

[[Asynchronous processing]]

[[Implicits]]

[[Play]]

[[ScalaTest]]

[[Substitution-related]]

[[Traits]]
** Akka
#= Akka =

*** [[Persistence API]]
**** Persistence API
***** Akka persistence
# %toc

****** Recover app state after a crash
****** opt-in at-least-once delivery
****** semantics between actors

To add as a dependency:
#+begin_example
"com.typesafe.akka" %% "akka-persistence-experimental" % "2.3.0"
#+end_example

It's a complete rewrite of the [[https://github.com/eligosource/eventsourced][Eventsourced]] library, a migration is possible.

****** Storing state transitions

Instead of storing state, transitions are being recorded.
E.g.
#+begin_example
Cart created => Added 2 socks => Added 2 shirts => Shipping info Added
#+end_example

The events can be replayed and they are immutable (a parallel with DB migration
incremental scripts?).
This is called _event sourcing_.

****** Domain events
******* things that have completed, _facts_
******* immutable
******* verbs in past tense
          - `CustomerRelocated`
          - `CargoShipped`
          - `InvoiceSent`
******* essential building block in DDD, representing the domain state transition.

*Benefits*:
******* Bulletproof auditing and historical tracing.
          - Think in terms of the history of transactions that caused a specific bank account balance to occur.
******* Support future ways of looking at data.
          - After adding new features, it is possible to recreate the past data in the new form.
          - Useful when creating an initial release and then, after discussing with the business, having to add new features and emulate the same state.
******* Performance and scalability
          - Streams can be scaled.
******* Testability
          - Define a sequence of events as a scenario - it makes expected actions very clear.
******* Reconstruct production scenarios
******* No object-relational impedance mismatch
          - No complex data structures are stored, no ORMs needed.
******* Nice fit with actors
          - It does not mean that it should be used everywhere alongside Akka.
          - It's not good for ad-hoc queries.

****** Different approaches

*Command sourcing*:
******* write-ahead-log
******* same behavior during recovery as normal operation
          - external interaction can be problematic
          - changing the command logic will cause retro steps to work as the new cmds
******* persisted before validation
******* allows retroactive changes to the business logic
******* naming: represent intent, imperative

*Event sourcing:*
******* derive events from a Command
******* only state-changing behavior during recovery
******* events cannot fail
******* fixing the business logic will not affect persisted models
******* naming: things that have completed, verbs in the past tense

****** Consistency boundary
******* An actor is a consistency boundary
          - corresponds to a DDD Aggregate
******* No distributed transactions
          - eventually consistent
          - compensating actions instead of transactional mechanisms

****** Building blocks
******* Processor

******** Automatic recovery on start and restart
******** Stashing until recovery completed
******** Failure handling with the supervisor strategy
