Scala.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 15:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org89089f3">1. Scala</a>
<ul>
<li><a href="#org18eb6a7">1.1. Akka</a>
<ul>
<li><a href="#orgaeab28c">1.1.1. </a>
<ul>
<li><a href="#org1071cee">1.1.1.1. Persistence API</a></li>
</ul>
</li>
<li><a href="#orgdb815ea">1.1.2. </a>
<ul>
<li><a href="#org642c3e1">1.1.2.1. Futures</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7ef499b">1.2. Asynchronous processing</a>
<ul>
<li><a href="#org609990a">1.2.1. Asynchronous processing</a>
<ul>
<li><a href="#orgc1ab5e0">1.2.1.1. Futures vs Promises</a></li>
<li><a href="#orgcffbd1f">1.2.1.2. Retrying</a></li>
<li><a href="#orga3911ce">1.2.1.3. Timeouts</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdceb144">1.3. Implicits</a>
<ul>
<li><a href="#orgfa28151">1.3.1. Scala - Implicits</a>
<ul>
<li><a href="#org1b53bb7">1.3.1.1. Implicit conversion</a></li>
<li><a href="#org3ac22bb">1.3.1.2. Implicit parameters</a></li>
<li><a href="#org1fd0c6d">1.3.1.3. View bounds</a></li>
<li><a href="#org7c812ab">1.3.1.4. Context Bounds</a></li>
<li><a href="#orgefa8933">1.3.1.5. Order of precedence for implicits</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8604eb5">1.4. Play</a>
<ul>
<li><a href="#orgf5ec1ea">1.4.1. Play</a>
<ul>
<li><a href="#org4ef440a">1.4.1.1. Architecture</a></li>
<li><a href="#org9757081">1.4.1.2. Jobs</a></li>
<li><a href="#org5aacfc7">1.4.1.3. Modularization</a></li>
<li><a href="#org03219ec">1.4.1.4. HTTP API design</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org527774d">1.5. ScalaTest</a>
<ul>
<li><a href="#org4d84591">1.5.1. lens</a></li>
</ul>
</li>
<li><a href="#org8ec6497">1.6. Substitution-related</a>
<ul>
<li><a href="#org52655d3">1.6.1. Substitution-related</a>
<ul>
<li><a href="#org35020dd">1.6.1.1. Substitution</a></li>
<li><a href="#orgfa1e0f5">1.6.1.2. Call-by-value</a></li>
<li><a href="#org3d51ee4">1.6.1.3. Call-by-name</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1397616">1.7. Traits</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org89089f3" class="outline-2">
<h2 id="org89089f3"><span class="section-number-2">1</span> Scala</h2>
<div class="outline-text-2" id="text-1">
<p>
#= Scala =
</p>

<p>
<a href="#org18eb6a7">1.1</a>
</p>

<p>
<a href="#org7ef499b">1.2</a>
</p>

<p>
<a href="#orgdceb144">1.3</a>
</p>

<p>
<a href="#org8604eb5">1.4</a>
</p>

<p>
<a href="#org527774d">1.5</a>
</p>

<p>
<a href="#org8ec6497">1.6</a>
</p>

<p>
<a href="#org1397616">1.7</a>
</p>
</div>
<div id="outline-container-org18eb6a7" class="outline-3">
<h3 id="org18eb6a7"><span class="section-number-3">1.1</span> Akka</h3>
<div class="outline-text-3" id="text-1-1">
<p>
#= Akka =
</p>
</div>

<div id="outline-container-orgaeab28c" class="outline-4">
<h4 id="orgaeab28c"><span class="section-number-4">1.1.1</span> <a href="#org1071cee">1.1.1.1</a></h4>
<div class="outline-text-4" id="text-1-1-1">
</div><div id="outline-container-org1071cee" class="outline-5">
<h5 id="org1071cee"><span class="section-number-5">1.1.1.1</span> Persistence API</h5>
<div class="outline-text-5" id="text-1-1-1-1">
</div><ol class="org-ol"><li><a id="org24ac3bd"></a>Akka persistence<br  /><ol class="org-ol"><li><a id="org5da55ad"></a>Recover app state after a crash<br  /></li>
<li><a id="org236fa90"></a>opt-in at-least-once delivery<br  /></li>
<li><a id="org6ac7e04"></a>semantics between actors<br  /><div class="outline-text-7" id="text-1-1-1-1-1-3">
<p>
To add as a dependency:
</p>
<pre class="example">
"com.typesafe.akka" %% "akka-persistence-experimental" % "2.3.0"
</pre>

<p>
It's a complete rewrite of the <a href="https://github.com/eligosource/eventsourced">Eventsourced</a> library, a migration is possible.
</p>
</div></li>

<li><a id="orgff62366"></a>Storing state transitions<br  /><div class="outline-text-7" id="text-1-1-1-1-1-4">
<p>
Instead of storing state, transitions are being recorded.
E.g.
</p>
<pre class="example">
Cart created =&gt; Added 2 socks =&gt; Added 2 shirts =&gt; Shipping info Added
</pre>

<p>
The events can be replayed and they are immutable (a parallel with DB migration
incremental scripts?).
This is called <span class="underline">event sourcing</span>.
</p>
</div></li>

<li><a id="org5bc06f3"></a>Domain events<br  /><ol class="org-ol"><li><a id="org8bd8083"></a>things that have completed, <span class="underline">facts</span><br  /></li>
<li><a id="orgf44b268"></a>immutable<br  /></li>
<li><a id="orge361a98"></a>verbs in past tense<br  /><div class="outline-text-8" id="text-1-1-1-1-1-5-3">
<ul class="org-ul">
<li>`CustomerRelocated`</li>
<li>`CargoShipped`</li>
<li>`InvoiceSent`</li>
</ul>
</div></li>
<li><a id="orgff15f1c"></a>essential building block in DDD, representing the domain state transition.<br  /><div class="outline-text-8" id="text-1-1-1-1-1-5-4">
<p>
<b>Benefits</b>:
</p>
</div></li>
<li><a id="orgd4e62f9"></a>Bulletproof auditing and historical tracing.<br  /><div class="outline-text-8" id="text-1-1-1-1-1-5-5">
<ul class="org-ul">
<li>Think in terms of the history of transactions that caused a specific bank account balance to occur.</li>
</ul>
</div></li>
<li><a id="org28c4269"></a>Support future ways of looking at data.<br  /><div class="outline-text-8" id="text-1-1-1-1-1-5-6">
<ul class="org-ul">
<li>After adding new features, it is possible to recreate the past data in the new form.</li>
<li>Useful when creating an initial release and then, after discussing with the business, having to add new features and emulate the same state.</li>
</ul>
</div></li>
<li><a id="org5466e93"></a>Performance and scalability<br  /><div class="outline-text-8" id="text-1-1-1-1-1-5-7">
<ul class="org-ul">
<li>Streams can be scaled.</li>
</ul>
</div></li>
<li><a id="org568c610"></a>Testability<br  /><div class="outline-text-8" id="text-1-1-1-1-1-5-8">
<ul class="org-ul">
<li>Define a sequence of events as a scenario - it makes expected actions very clear.</li>
</ul>
</div></li>
<li><a id="orgd02e470"></a>Reconstruct production scenarios<br  /></li>
<li><a id="orgc39e406"></a>No object-relational impedance mismatch<br  /><div class="outline-text-8" id="text-1-1-1-1-1-5-10">
<ul class="org-ul">
<li>No complex data structures are stored, no ORMs needed.</li>
</ul>
</div></li>
<li><a id="orgece20b1"></a>Nice fit with actors<br  /><div class="outline-text-8" id="text-1-1-1-1-1-5-11">
<ul class="org-ul">
<li>It does not mean that it should be used everywhere alongside Akka.</li>
<li>It's not good for ad-hoc queries.</li>
</ul>
</div></li></ol></li>

<li><a id="org97ecdb2"></a>Different approaches<br  /><div class="outline-text-7" id="text-1-1-1-1-1-6">
<p>
<b>Command sourcing</b>:
</p>
</div>
<ol class="org-ol"><li><a id="org84e2a56"></a>write-ahead-log<br  /></li>
<li><a id="orgfe96665"></a>same behavior during recovery as normal operation<br  /><div class="outline-text-8" id="text-1-1-1-1-1-6-2">
<ul class="org-ul">
<li>external interaction can be problematic</li>
<li>changing the command logic will cause retro steps to work as the new cmds</li>
</ul>
</div></li>
<li><a id="orgbb0e763"></a>persisted before validation<br  /></li>
<li><a id="orgf58f105"></a>allows retroactive changes to the business logic<br  /></li>
<li><a id="org7504c65"></a>naming: represent intent, imperative<br  /><div class="outline-text-8" id="text-1-1-1-1-1-6-5">
<p>
<b>Event sourcing:</b>
</p>
</div></li>
<li><a id="org6dd630e"></a>derive events from a Command<br  /></li>
<li><a id="org7687faa"></a>only state-changing behavior during recovery<br  /></li>
<li><a id="org8916041"></a>events cannot fail<br  /></li>
<li><a id="org3a964f1"></a>fixing the business logic will not affect persisted models<br  /></li>
<li><a id="org780cbda"></a>naming: things that have completed, verbs in the past tense<br  /></li></ol></li>

<li><a id="orgdcaf23e"></a>Consistency boundary<br  /><ol class="org-ol"><li><a id="orgd6f8907"></a>An actor is a consistency boundary<br  /><div class="outline-text-8" id="text-1-1-1-1-1-7-1">
<ul class="org-ul">
<li>corresponds to a DDD Aggregate</li>
</ul>
</div></li>
<li><a id="org774867d"></a>No distributed transactions<br  /><div class="outline-text-8" id="text-1-1-1-1-1-7-2">
<ul class="org-ul">
<li>eventually consistent</li>
<li>compensating actions instead of transactional mechanisms</li>
</ul>
</div></li></ol></li>

<li><a id="orgeb3d878"></a>Building blocks<br  /><ol class="org-ol"><li><a id="org91f465c"></a>Processor<br  /><ol class="org-ol"><li><a id="orge598303"></a>Automatic recovery on start and restart<br  /></li>
<li><a id="orgf33976f"></a>Stashing until recovery completed<br  /></li>
<li><a id="org3fc3901"></a>Failure handling with the supervisor strategy<br  /></li>
