Scala.org
******** Might want to delete erroneous messages

Minimal processor example
#+begin_example
import akka.persistence.{ Persistent, Processor }
class MyProcessor extends Processor {
    def receive = {
        case Persistent(payload, sequenceNr) =>
            // msg successfully written to Journal
        case other => // msg not written to journal
    }
}

val processor = context.actorOf(Props[MyProcessor], name = "myProcessor")

processor ! Persistent("foo")   // journaled
processor ! "bar"               // not journaled
#+end_example

Real-world example:
#+begin_example

class InvoiceService extends Processor {
    var invoices = Map.empty[String, Invoice]

    def receive: Receive = {
        case Persistent(CreateInvoice(id), _) =>
            invoices = invoices.updated(id, Invoice(id))
        case Persistent(AddInvoiceItem(id, item), _) =>
            invoices.get(id) match {
                case Some(inv) =>
                    invoices = invoices.updated(id, inv.addItem(item))
                case None => // TODO recovery
            }
        case GetInvoice(id) =>
            sender() ! invoices.getOrElse(id, "not found: " + id) ===

        case Persistent(SendInvoiceTo(id, address), _) =>
            // TODO send to the invoice printing service.
    }
}
#+end_example

Invoice context code:
#+begin_example
case class CreateInvoice(invoiceId: String)
case class AddInvoiceItem(invoiceId: String, invoiceItem: InvoiceItem)
case class SendInvoiceTo(invoiceId: String, to: InvoiceAddress)
case class GetInvoice(invoiceId: String)

case class Invoice(id: String, items: IndexedSeq[InvoiceItem] = Vector.empty) {
    def addItem(item: InvoiceItem): Invoice = copy(items = items :+ item)
}

case class InvoiceItem(description: String, count: Int, amount: BigDecimal)
case class InvoiceAddress(name: String, street: String, city: String)
#+end_example

Processor identifier - the default identifier is the path of the actor:
`/user/top/myProcessor`.

Anonymous processors should not be used as the names may change on system
startup.
#+begin_example
    override def processorId = "my-stable-processor-id"
#+end_example

******** Processor with Channel
Handshaking - sending delivery and confirmation messages.
#+begin_example
val printingChannel = context.actorOf(Channel.props(), name = "printingChannel")
val printingDestination = context.system / "printingService"
// 'printingService' probably should be 'printingChannel'.

def receive: Receive = {
    case p @ Persistent(SendInvoiceTo(id, address), _) => 
        // send to the invoice printing machine
        invoices.get(id) match {
            case Some(inv) =>
                printingChannel ! Deliver(p.withPayload(
                    PrintingOrder(inv, address), printingDestination)
                invoices -= inv.id
            case None => TODO
        }
}

class PrintingService extends Actor {
    def receive = {
        case p @ ConfirmablePersistent(payload, sequenceNr, redeliveries) =>
            // ...
            p.confirm()
    }
}
#+end_example

******* Eventsourced processor
Incoming messages (commands) are not persisted.

Steps:
******** Validate Command
******** Create domain event and explicitly persist it
******** Update internal state by *applying the event*
******** External side effects

During recovery the internal state is updated by applying the events, which
prevents any external side effects.

Example:
#+begin_example
class BlogPost extends EventsourcedProcessor {
    import BlogPost._
    override def receiveCommand: Receive = ???
    override def receiveRecover: Receive = ???

    private var state = State("","","",false)

    override def receiveCommand: Receive = {
        case AddPost(author, title) =>
            // The difference between command and event approaches is clear here
            if(state.body == "" && author != "" && title != "") {
                persist(PostAdded(author, title)) { evt =>
                    state = state.updated(evt)
                }
            }

        case ChangeBody(body) =>
            if(!state.published) {
                persist(BodyChanged(body)) { evt =>
                    state = state.updated(evt)
                }
            }

        case Publish =>
            if(!state.published) {
                persist(PostPublished) { evt =>
                    state = state.updated(evt)
                    // call the external web content service...
                }
            }
    }

    override def receiveRecover: Receive = {
        case evt: Event => state = state.updated(evt)
    }
}

object BlogPost {
    import BlogPost._
    case class AddPost(athor: String, title: String) // domain command

    // this is the proposed way:
    sealed trait Event
    case class PostAdded(author: String, title: String) extends Event
    case class BodyChanged(body: String) extends Event
    case object PostPublished extends Event

    private class State(author: String, title: String, body: String,
                        published: Boolean) {
        def updated(evt: Event): State = evt match {
            case PostAdded(author, title)   => copy(author, title)
            case BodyChanged(b)             => copy(body = b)
            case PostPublished              => copy(published = true)
        }
    }
}
#+end_example

Additional functionality: support for snapshots.

#+begin_example
class MyProcessor extends Processor {
    var state: Any = _

    def receive = {
        case "snap"                                   => saveSnapshot(state)
        case SaveSnapshotSuccess(metadata)            => // ...
        case SaveSnapshotFailure(metadata, reason)    => // ...

        case SnapshotOffer(metadata, offeredSnapshot) => state = offeredSnapshot
        case Persistent(payload, _)                   => // ...
    }
}
#+end_example

******* View
Replays persistent messages from a Processor's journal.
Serves as the query side of CQRS.

Features:
******** auto-update interval,
******** update message,
******** limit,
******** may store its own snapshots.

Example:
#+begin_example
class InvoiceCounter extends View {
    import InvoiceCounter._
    override def processorId: String = "/user/InvoiceService"
    override def autoUpdateInterval = 10 seconds

    var count = 0L

    def receive: Actor.Receive = {
        case Persistent(payload: SendInvoiceTo, _) => count += 1
        case _: Persistent =>
        case GetInvoiceCount => sender ! InvoiceCount(count)
    }
}

object InvoiceCounter {
    case object GetInvoiceCount
    case class InvoiceCount(count: Long)
}
#+end_example

******* Persistent Channel
Used for at-least-once delivery.

A message might be dropped.
To be sure that a message has arrived, an acknowledgment from the receiver.
The acknowledgment delivery may also fail - in that case the message must be
resent.
This is the _at-least-once_ delivery mode.

Channels re-deliver messages until confirmed.
The confirmation is on application level.
Different semantics:
******** duplicates received
******** message order not retained
