Scala.html
<li><a id="orgf1000f1"></a>Might want to delete erroneous messages<br  /><div class="outline-text-9" id="text-1-1-1-1-1-8-1-4">
<p>
Minimal processor example
</p>
<pre class="example">
import akka.persistence.{ Persistent, Processor }
class MyProcessor extends Processor {
    def receive = {
        case Persistent(payload, sequenceNr) =&gt;
            // msg successfully written to Journal
        case other =&gt; // msg not written to journal
    }
}

val processor = context.actorOf(Props[MyProcessor], name = "myProcessor")

processor ! Persistent("foo")   // journaled
processor ! "bar"               // not journaled
</pre>

<p>
Real-world example:
</p>
<pre class="example">
class InvoiceService extends Processor {
    var invoices = Map.empty[String, Invoice]

    def receive: Receive = {
        case Persistent(CreateInvoice(id), _) =&gt;
            invoices = invoices.updated(id, Invoice(id))
        case Persistent(AddInvoiceItem(id, item), _) =&gt;
            invoices.get(id) match {
                case Some(inv) =&gt;
                    invoices = invoices.updated(id, inv.addItem(item))
                case None =&gt; // TODO recovery
            }
        case GetInvoice(id) =&gt;
            sender() ! invoices.getOrElse(id, "not found: " + id) ===

        case Persistent(SendInvoiceTo(id, address), _) =&gt;
            // TODO send to the invoice printing service.
    }
}
</pre>

<p>
Invoice context code:
</p>
<pre class="example">
case class CreateInvoice(invoiceId: String)
case class AddInvoiceItem(invoiceId: String, invoiceItem: InvoiceItem)
case class SendInvoiceTo(invoiceId: String, to: InvoiceAddress)
case class GetInvoice(invoiceId: String)

case class Invoice(id: String, items: IndexedSeq[InvoiceItem] = Vector.empty) {
    def addItem(item: InvoiceItem): Invoice = copy(items = items :+ item)
}

case class InvoiceItem(description: String, count: Int, amount: BigDecimal)
case class InvoiceAddress(name: String, street: String, city: String)
</pre>

<p>
Processor identifier - the default identifier is the path of the actor:
`/user/top/myProcessor`.
</p>

<p>
Anonymous processors should not be used as the names may change on system
startup.
</p>
<pre class="example">
override def processorId = "my-stable-processor-id"
</pre>
</div></li>

<li><a id="orgcb11582"></a>Processor with Channel<br  /><div class="outline-text-9" id="text-1-1-1-1-1-8-1-5">
<p>
Handshaking - sending delivery and confirmation messages.
</p>
<pre class="example">
val printingChannel = context.actorOf(Channel.props(), name = "printingChannel")
val printingDestination = context.system / "printingService"
// 'printingService' probably should be 'printingChannel'.

def receive: Receive = {
    case p @ Persistent(SendInvoiceTo(id, address), _) =&gt; 
        // send to the invoice printing machine
        invoices.get(id) match {
            case Some(inv) =&gt;
                printingChannel ! Deliver(p.withPayload(
                    PrintingOrder(inv, address), printingDestination)
                invoices -= inv.id
            case None =&gt; TODO
        }
}

class PrintingService extends Actor {
    def receive = {
        case p @ ConfirmablePersistent(payload, sequenceNr, redeliveries) =&gt;
            // ...
            p.confirm()
    }
}
</pre>
</div></li></ol></li>

<li><a id="orgb837299"></a>Eventsourced processor<br  /><div class="outline-text-8" id="text-1-1-1-1-1-8-2">
<p>
Incoming messages (commands) are not persisted.
</p>

<p>
Steps:
</p>
</div>
<ol class="org-ol"><li><a id="orgda550c2"></a>Validate Command<br  /></li>
<li><a id="org8e19c45"></a>Create domain event and explicitly persist it<br  /></li>
<li><a id="org214d154"></a>Update internal state by <b>applying the event</b><br  /></li>
<li><a id="org38ec26f"></a>External side effects<br  /><div class="outline-text-9" id="text-1-1-1-1-1-8-2-4">
<p>
During recovery the internal state is updated by applying the events, which
prevents any external side effects.
</p>

<p>
Example:
</p>
<pre class="example">
class BlogPost extends EventsourcedProcessor {
    import BlogPost._
    override def receiveCommand: Receive = ???
    override def receiveRecover: Receive = ???

    private var state = State("","","",false)

    override def receiveCommand: Receive = {
        case AddPost(author, title) =&gt;
            // The difference between command and event approaches is clear here
            if(state.body == "" &amp;&amp; author != "" &amp;&amp; title != "") {
                persist(PostAdded(author, title)) { evt =&gt;
                    state = state.updated(evt)
                }
            }

        case ChangeBody(body) =&gt;
            if(!state.published) {
                persist(BodyChanged(body)) { evt =&gt;
                    state = state.updated(evt)
                }
            }

        case Publish =&gt;
            if(!state.published) {
                persist(PostPublished) { evt =&gt;
                    state = state.updated(evt)
                    // call the external web content service...
                }
            }
    }

    override def receiveRecover: Receive = {
        case evt: Event =&gt; state = state.updated(evt)
    }
}

object BlogPost {
    import BlogPost._
    case class AddPost(athor: String, title: String) // domain command

    // this is the proposed way:
    sealed trait Event
    case class PostAdded(author: String, title: String) extends Event
    case class BodyChanged(body: String) extends Event
    case object PostPublished extends Event

    private class State(author: String, title: String, body: String,
                        published: Boolean) {
        def updated(evt: Event): State = evt match {
            case PostAdded(author, title)   =&gt; copy(author, title)
            case BodyChanged(b)             =&gt; copy(body = b)
            case PostPublished              =&gt; copy(published = true)
        }
    }
}
</pre>

<p>
Additional functionality: support for snapshots.
</p>

<pre class="example">
class MyProcessor extends Processor {
    var state: Any = _

    def receive = {
        case "snap"                                   =&gt; saveSnapshot(state)
        case SaveSnapshotSuccess(metadata)            =&gt; // ...
        case SaveSnapshotFailure(metadata, reason)    =&gt; // ...

        case SnapshotOffer(metadata, offeredSnapshot) =&gt; state = offeredSnapshot
        case Persistent(payload, _)                   =&gt; // ...
    }
}
</pre>
</div></li></ol></li>

<li><a id="org122115d"></a>View<br  /><div class="outline-text-8" id="text-1-1-1-1-1-8-3">
<p>
Replays persistent messages from a Processor's journal.
Serves as the query side of CQRS.
</p>

<p>
Features:
</p>
</div>
<ol class="org-ol"><li><a id="org003b77c"></a>auto-update interval,<br  /></li>
<li><a id="orgfbb9ea0"></a>update message,<br  /></li>
<li><a id="org2230da6"></a>limit,<br  /></li>
<li><a id="orgec2bd11"></a>may store its own snapshots.<br  /><div class="outline-text-9" id="text-1-1-1-1-1-8-3-4">
<p>
Example:
</p>
<pre class="example">
class InvoiceCounter extends View {
    import InvoiceCounter._
    override def processorId: String = "/user/InvoiceService"
    override def autoUpdateInterval = 10 seconds

    var count = 0L

    def receive: Actor.Receive = {
        case Persistent(payload: SendInvoiceTo, _) =&gt; count += 1
        case _: Persistent =&gt;
        case GetInvoiceCount =&gt; sender ! InvoiceCount(count)
    }
}

object InvoiceCounter {
    case object GetInvoiceCount
    case class InvoiceCount(count: Long)
}
</pre>
</div></li></ol></li>

<li><a id="org234ff91"></a>Persistent Channel<br  /><div class="outline-text-8" id="text-1-1-1-1-1-8-4">
<p>
Used for at-least-once delivery.
</p>

<p>
A message might be dropped.
To be sure that a message has arrived, an acknowledgment from the receiver.
The acknowledgment delivery may also fail - in that case the message must be
resent.
This is the <span class="underline">at-least-once</span> delivery mode.
</p>

<p>
Channels re-deliver messages until confirmed.
The confirmation is on application level.
Different semantics:
</p>
</div>
<ol class="org-ol"><li><a id="orgf047b37"></a>duplicates received<br  /></li>
<li><a id="orgb7da5e7"></a>message order not retained<br  /></li>
