Scala.org
******** after a creash and restart messages are still delivered

Recommendation: use one destination per channel.
The exception is when replies are being sent via the channel.

Where a Channel is meant to be used from within a Processor and resides within
memory, the PersistentChannel is to be used standalone.

It is conceptually a processor + a channel.
It persists messages before delivering, replies `ack` when persisted and allows
more advanced delivery flow control.

Example:
#+begin_example
class MyProcessor extends Processor {
    val channel = context.actorOf(Channel.props(), name = "myChannel")

    def receive = {
        case p @ Persistent(payload, _) =>
            val destination = context.system / "myDestination"
            channel ! Deliver(p.withPayload("output msg"), destination)
    }
}

class MyDestination extends Actor {
    def receive = {
        case p @ ConfirmablePersistent(payload, sequenceNr, redeliveries) =>
            // ...
            p.confirm()
    }
}

class Endpoint extends Actor {
    val channel = context.actorOf(
            PersistentChannel.props(PersistentChannelSettings(
                    redeliverInterval = 3 seconds,
                    redeliverMax = 10,
                    replyPersistent = true)
            ),
            name = "myChannel")
    val destination = context.system / "jobManager"

    import context.dispatcher
    implicit val timeout = Timeout(5 seconds)

    def receive = {
        case job: Job =>
            (channel ? Deliver(Persistent(job), destination)) map {
                // send the acknowledgment
                case _: Persistent => "OK: " + job.id
            } recover {
                case e => "FAILED: " + job.id
            } pipeTo sender()
    }
}
#+end_example

******* Serialization
******** Pluggable, Akka serialization
******** app life-cycle, versioning
******** don't use default Java serialization

******** Journal
********* Pluggable
********* LevelDB shipped with Akka - local files
********* [[http://akka.io/community/][Community journals]] can be used

******* Cluster
******** simple way of migrating/moving stateful actors in a cluster
******** distributed journal
           - shared LevelDB journal for testing
           - try the Cassandra alternative
******** single write per event stream

******** Cluster singleton
Follow-up...

******** Cluster sharding
Follow-up...

Send the recipient identifier with a message to a cluster sharding region.

A routing coordinator is required.

#+begin_example
val idExtractor: ShardRegion.IdExtractor = {
    case cmd: Command => (cmd.postId, cmd)
}

val shardResolver: ShardRegion.ShardResolver = msg => msg match {
    case cmd: Command => (math.abs(cmd.postId.hashCode) % 100).toString
}

ClusterSharding(system).start(
    typeName = BlogPost.shardName,
    entryProps = Some(BlogPost.props()),
    idExtractor = BlogPost.idExtractor,
    shardResolver = BlogPost.ShardResolver)

val postRegion: ActorRef =
    ClusterSharding(context.system).shardRegion(BlogPost.shardName)

val postId = UUID.randomUUID().toString
postRegion ! BlogPost.AddPost(postId, author, title)
#+end_example
*** [[Futures]]
**** Futures
#= Akka - Futures =
Notes from "Composable Futures with Akka" will go here.

Code examples:
***** https://bitbucket.org/mslinn/akkafutures
** Asynchronous processing
*** Asynchronous processing

**** Futures vs Promises

Futures and Promises implement the same concept, but Promises are read-write
(i.e. you can do side effects with them).

Futures are just read-only handles to computations that are going to finish in
some time.

**** Retrying

The problem:

#+begin_example
def toss(probability: Int) {
    if(rand.nextInt % probability == 0)
        throw new RuntimeException("Boom");
}

Await.result(future(toss(2)), 50 millis)
Await.result(future(toss(2)), 50 millis)
// reflection of a non-deterministic behavior concept
#+end_example

We want a method kinda like this:

#+begin_example
// f should run for at most n+1 times.
def retry[T](n: Int)(f: => T): Future[T] =
    future { f } recoverWith {
        case e if n > 0 => retry(n - 1)(f)
    }

#+end_example

**** Timeouts

The problem:

#+begin_example
def aBlockingSlowCall: String = {
    Thread.sleep(1000)
    "foo"
}

future { aBlockingSlowCall }
res: s.c.Future[String] = ...

Await.result(res, 500 millis)
// j.u.c.TimeoutException: Futures timed out after [500 ms]
#+end_example

The problem is that the timeout is only known at the `Await` level.
It sucks due to the fact that `Await`s are generally put at the web controller
level.

What we really want is for each component to know about its related timeouts.

Enter `com.twitter.util.Future`:

#+begin_example
def within(timeout: Duration)(implicit timer: Timer): Future[A]

val pool = FuturePool.unboundedPool

pool { aBlockingSlowCall }
    within (100 millis)

res: c.t.u.Future[String] = ???

Await.result(res)
// c.t.u.TimeoutException: 100.milliseconds
#+end_example

[[https://github.com/wix/future-perfect][Future perfect]] from Wix provides an abstraction over c.t.u.Futures.

#+begin_example
object App extends FuturePerfect { // FP is a trait
    val executorService = Executors.newScheduledThreadPool(10)

    val future = execution(
        name = "foo",
        timeout = 100 millis,
        retryPolicy = RetryPolicy(retries = 1)) {
            // some blocking call
            // partial function can be defined for specific exception cases
        })
}

val result = Await.result(future)
#+end_example

The problem with future perfect is that you get a Twitter future back, not a
Scala future.
To convert between the two:

#+begin_example
import com.twitter.{util => tw} // import util as tw

implicit def twf2scf[T](tf: tw.Future[T]):
    Future[T] = {
        val p = Promise[T]
        tf respond {
            case tw.Return(r) => p success r
            case tw.Throw(e) => p failure e
        }

        p.future
    }
#+end_example



** Implicits
*** Scala - Implicits

An implicit could be an "ambient" value for some scope or a conversion which can be applied automatically (implicitly :)).

**** Implicit conversion

Example:

#+begin_example
"abc".map(_.toString)
#+end_example

`String` does not support a `map` operation, but `StringOps` does - and if there exists a conversion from `String` to `StringOps`, then the example code will compile and work as expected.

