Scala.html
<li><a id="org2c4dd61"></a>after a creash and restart messages are still delivered<br  /><div class="outline-text-9" id="text-1-1-1-1-1-8-4-3">
<p>
Recommendation: use one destination per channel.
The exception is when replies are being sent via the channel.
</p>

<p>
Where a Channel is meant to be used from within a Processor and resides within
memory, the PersistentChannel is to be used standalone.
</p>

<p>
It is conceptually a processor + a channel.
It persists messages before delivering, replies `ack` when persisted and allows
more advanced delivery flow control.
</p>

<p>
Example:
</p>
<pre class="example">
class MyProcessor extends Processor {
    val channel = context.actorOf(Channel.props(), name = "myChannel")

    def receive = {
        case p @ Persistent(payload, _) =&gt;
            val destination = context.system / "myDestination"
            channel ! Deliver(p.withPayload("output msg"), destination)
    }
}

class MyDestination extends Actor {
    def receive = {
        case p @ ConfirmablePersistent(payload, sequenceNr, redeliveries) =&gt;
            // ...
            p.confirm()
    }
}

class Endpoint extends Actor {
    val channel = context.actorOf(
            PersistentChannel.props(PersistentChannelSettings(
                    redeliverInterval = 3 seconds,
                    redeliverMax = 10,
                    replyPersistent = true)
            ),
            name = "myChannel")
    val destination = context.system / "jobManager"

    import context.dispatcher
    implicit val timeout = Timeout(5 seconds)

    def receive = {
        case job: Job =&gt;
            (channel ? Deliver(Persistent(job), destination)) map {
                // send the acknowledgment
                case _: Persistent =&gt; "OK: " + job.id
            } recover {
                case e =&gt; "FAILED: " + job.id
            } pipeTo sender()
    }
}
</pre>
</div></li></ol></li>

<li><a id="orgf77deac"></a>Serialization<br  /><ol class="org-ol"><li><a id="org2f63500"></a>Pluggable, Akka serialization<br  /></li>
<li><a id="orgd7a1880"></a>app life-cycle, versioning<br  /></li>
<li><a id="orge69042b"></a>don't use default Java serialization<br  /></li>

<li><a id="org9dc5762"></a>Journal<br  /><ol class="org-ol"><li><a id="org8c09267"></a>Pluggable<br  /></li>
<li><a id="org50e41ca"></a>LevelDB shipped with Akka - local files<br  /></li>
<li><a id="org90bdb61"></a><a href="http://akka.io/community/">Community journals</a> can be used<br  /></li></ol></li></ol></li>

<li><a id="orgc7f0c47"></a>Cluster<br  /><ol class="org-ol"><li><a id="org4238477"></a>simple way of migrating/moving stateful actors in a cluster<br  /></li>
<li><a id="org1c66c48"></a>distributed journal<br  /><div class="outline-text-9" id="text-1-1-1-1-1-8-6-2">
<ul class="org-ul">
<li>shared LevelDB journal for testing</li>
<li>try the Cassandra alternative</li>
</ul>
</div></li>
<li><a id="org74b517e"></a>single write per event stream<br  /></li>

<li><a id="org75f7191"></a>Cluster singleton<br  /><div class="outline-text-9" id="text-1-1-1-1-1-8-6-4">
<p>
Follow-up&#x2026;
</p>
</div></li>

<li><a id="org1b5427c"></a>Cluster sharding<br  /><div class="outline-text-9" id="text-1-1-1-1-1-8-6-5">
<p>
Follow-up&#x2026;
</p>

<p>
Send the recipient identifier with a message to a cluster sharding region.
</p>

<p>
A routing coordinator is required.
</p>

<pre class="example">
val idExtractor: ShardRegion.IdExtractor = {
    case cmd: Command =&gt; (cmd.postId, cmd)
}

val shardResolver: ShardRegion.ShardResolver = msg =&gt; msg match {
    case cmd: Command =&gt; (math.abs(cmd.postId.hashCode) % 100).toString
}

ClusterSharding(system).start(
    typeName = BlogPost.shardName,
    entryProps = Some(BlogPost.props()),
    idExtractor = BlogPost.idExtractor,
    shardResolver = BlogPost.ShardResolver)

val postRegion: ActorRef =
    ClusterSharding(context.system).shardRegion(BlogPost.shardName)

val postId = UUID.randomUUID().toString
postRegion ! BlogPost.AddPost(postId, author, title)
</pre>
</div></li></ol></li></ol></li></ol></li></ol>
</div>
</div>
<div id="outline-container-orgdb815ea" class="outline-4">
<h4 id="orgdb815ea"><span class="section-number-4">1.1.2</span> <a href="#org642c3e1">1.1.2.1</a></h4>
<div class="outline-text-4" id="text-1-1-2">
</div><div id="outline-container-org642c3e1" class="outline-5">
<h5 id="org642c3e1"><span class="section-number-5">1.1.2.1</span> Futures</h5>
<div class="outline-text-5" id="text-1-1-2-1">
<p>
#= Akka - Futures =
Notes from "Composable Futures with Akka" will go here.
</p>

<p>
Code examples:
</p>
</div>
<ol class="org-ol"><li><a id="org093cefb"></a><a href="https://bitbucket.org/mslinn/akkafutures">https://bitbucket.org/mslinn/akkafutures</a><br  /></li></ol>
</div>
</div>
</div>
<div id="outline-container-org7ef499b" class="outline-3">
<h3 id="org7ef499b"><span class="section-number-3">1.2</span> Asynchronous processing</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-org609990a" class="outline-4">
<h4 id="org609990a"><span class="section-number-4">1.2.1</span> Asynchronous processing</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><div id="outline-container-orgc1ab5e0" class="outline-5">
<h5 id="orgc1ab5e0"><span class="section-number-5">1.2.1.1</span> Futures vs Promises</h5>
<div class="outline-text-5" id="text-1-2-1-1">
<p>
Futures and Promises implement the same concept, but Promises are read-write
(i.e. you can do side effects with them).
</p>

<p>
Futures are just read-only handles to computations that are going to finish in
some time.
</p>
</div>
</div>

<div id="outline-container-orgcffbd1f" class="outline-5">
<h5 id="orgcffbd1f"><span class="section-number-5">1.2.1.2</span> Retrying</h5>
<div class="outline-text-5" id="text-1-2-1-2">
<p>
The problem:
</p>

<pre class="example">
def toss(probability: Int) {
    if(rand.nextInt % probability == 0)
        throw new RuntimeException("Boom");
}

Await.result(future(toss(2)), 50 millis)
Await.result(future(toss(2)), 50 millis)
// reflection of a non-deterministic behavior concept
</pre>

<p>
We want a method kinda like this:
</p>

<pre class="example">
// f should run for at most n+1 times.
def retry[T](n: Int)(f: =&gt; T): Future[T] =
    future { f } recoverWith {
        case e if n &gt; 0 =&gt; retry(n - 1)(f)
    }
</pre>
</div>
</div>

<div id="outline-container-orga3911ce" class="outline-5">
<h5 id="orga3911ce"><span class="section-number-5">1.2.1.3</span> Timeouts</h5>
<div class="outline-text-5" id="text-1-2-1-3">
<p>
The problem:
</p>

<pre class="example">
def aBlockingSlowCall: String = {
    Thread.sleep(1000)
    "foo"
}

future { aBlockingSlowCall }
res: s.c.Future[String] = ...

Await.result(res, 500 millis)
// j.u.c.TimeoutException: Futures timed out after [500 ms]
</pre>

<p>
The problem is that the timeout is only known at the `Await` level.
It sucks due to the fact that `Await`s are generally put at the web controller
level.
</p>

<p>
What we really want is for each component to know about its related timeouts.
</p>

<p>
Enter `com.twitter.util.Future`:
</p>

<pre class="example">
def within(timeout: Duration)(implicit timer: Timer): Future[A]

val pool = FuturePool.unboundedPool

pool { aBlockingSlowCall }
    within (100 millis)

res: c.t.u.Future[String] = ???

Await.result(res)
// c.t.u.TimeoutException: 100.milliseconds
</pre>

<p>
<a href="https://github.com/wix/future-perfect">Future perfect</a> from Wix provides an abstraction over c.t.u.Futures.
</p>

<pre class="example">
object App extends FuturePerfect { // FP is a trait
    val executorService = Executors.newScheduledThreadPool(10)

    val future = execution(
        name = "foo",
        timeout = 100 millis,
        retryPolicy = RetryPolicy(retries = 1)) {
            // some blocking call
            // partial function can be defined for specific exception cases
        })
}

val result = Await.result(future)
</pre>

<p>
The problem with future perfect is that you get a Twitter future back, not a
Scala future.
To convert between the two:
</p>

<pre class="example">
import com.twitter.{util =&gt; tw} // import util as tw

implicit def twf2scf[T](tf: tw.Future[T]):
    Future[T] = {
        val p = Promise[T]
        tf respond {
            case tw.Return(r) =&gt; p success r
            case tw.Throw(e) =&gt; p failure e
        }

        p.future
    }
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orgdceb144" class="outline-3">
<h3 id="orgdceb144"><span class="section-number-3">1.3</span> Implicits</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-orgfa28151" class="outline-4">
<h4 id="orgfa28151"><span class="section-number-4">1.3.1</span> Scala - Implicits</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
An implicit could be an "ambient" value for some scope or a conversion which can be applied automatically (implicitly :)).
</p>
</div>

<div id="outline-container-org1b53bb7" class="outline-5">
<h5 id="org1b53bb7"><span class="section-number-5">1.3.1.1</span> Implicit conversion</h5>
<div class="outline-text-5" id="text-1-3-1-1">
<p>
Example:
</p>

<pre class="example">
"abc".map(_.toString)
</pre>

<p>
`String` does not support a `map` operation, but `StringOps` does - and if there exists a conversion from `String` to `StringOps`, then the example code will compile and work as expected.
</p>
</div>
</div>
