Scala.html

<div id="outline-container-org3ac22bb" class="outline-5">
<h5 id="org3ac22bb"><span class="section-number-5">1.3.1.2</span> Implicit parameters</h5>
<div class="outline-text-5" id="text-1-3-1-2">
<p>
Implicit parameters work just like normal ones, except for that the compiler tries to fill them in automatically - if it cannot, it will throw an error.
</p>

<p>
Example:
</p>
<pre class="example">
def foo[T](t: T)(implicit integral: Integral[T]) {println(integral)}
</pre>
</div>
</div>

<div id="outline-container-org1fd0c6d" class="outline-5">
<h5 id="org1fd0c6d"><span class="section-number-5">1.3.1.3</span> View bounds</h5>
<div class="outline-text-5" id="text-1-3-1-3">
<p>
In the following example, an implicit value acts both as an implicit conversion and an implicit parameter:
</p>

<pre class="example">
def getIndex[T, CC](seq: CC, value: T)(implicit conv: CC =&gt; Seq[T]) = seq.indexOf(value)

getIndex("abc", 'a')
</pre>

<p>
This function can receive any objects as `seq` and `value` as long as an appropriate conversion exists.
</p>

<p>
This pattern is <b>very useful</b>, to the point of having syntactic sugar of <b>view bounds</b> for it:
</p>

<pre class="example">
def getIndex[T, CC &lt;% Seq[T]](seq: CC, value: T) = seq.indexOf(value)
</pre>

<p>
There is a kinship between the view bound and the upper bound (`CC &lt;: Seq[Int]`) or the lower bound (`T &gt;: Null`).
</p>
</div>
</div>

<div id="outline-container-org7c812ab" class="outline-5">
<h5 id="org7c812ab"><span class="section-number-5">1.3.1.4</span> Context Bounds</h5>
<div class="outline-text-5" id="text-1-3-1-4">
<p>
Context bounds pose syntactic sugar for having to provide an implicit parameter.
This technique is useful when achieving ad-hoc polymorphism through typeclasses, enabling common interface provisioning to classes which did not declare them.
Typeclasses can be used as bridges as well as adapters.
</p>

<p>
Example:
</p>
<pre class="example">
// without a context bound
def sum[T](list: List[T])(implicit integral: Integral[T]): T = {
    import integral._
    list.foldLeft(integral.zero)(_ + _)
}

// with a context bound
def sum[T: Integral](list: List[T]): T = {
    // You have to refer the implicit.
    val integral = implicitly[Integral[T]]
    import integral._
    list.foldLeft(integral.zero)(_ + _)
}
</pre>

<p>
Context bounds are more useful when you just pass them to other methods which use them.
Example: the `sorted` method on `Seq` needs an implicit `Ordering`.
To create a `reverseSort` method, one could write:
</p>
<pre class="example">
def reverseSort[T: Ordering](seq: Seq[T]) = seq.sorted.reverse
</pre>

<p>
The `Ordering[T]` was implicitly passed using a context bound, it can be as well passed implicitly to `sorted`.
</p>
</div>
</div>

<div id="outline-container-orgefa8933" class="outline-5">
<h5 id="orgefa8933"><span class="section-number-5">1.3.1.5</span> Order of precedence for implicits</h5>
<div class="outline-text-5" id="text-1-3-1-5">
<p>
Primary search locations:
</p>
</div>

<ol class="org-ol"><li><a id="org082b740"></a>Implicits defined in current scope<br  /><div class="outline-text-6" id="text-1-3-1-5-1">
<pre class="example">
implicit val n: Int = 5
def add(x: Int)(implicit y: Int) = x+y
add(5) // 10
</pre>
</div></li>

<li><a id="orgb8cd74e"></a>explicit imports<br  /><div class="outline-text-6" id="text-1-3-1-5-2">
<pre class="example">
import scala.collection.JavaConversions.mapAsScalaMap
def env = System.getenv() // Java map
val term = env("TERM") // implicit Java map -&gt; Scala map conversion
</pre>
</div></li>

<li><a id="orgd4773ed"></a>wildcard imports (see the context bound example)<br  /><div class="outline-text-6" id="text-1-3-1-5-3">
<p>
Secondary search locations:
</p>
</div></li>

<li><a id="org3cc633a"></a>companion objects of a type<br  /><div class="outline-text-6" id="text-1-3-1-5-4">
<ul class="org-ul">
<li>first, the companion object for the "source" type is looked into. E.g. inside the `object Option` there is an implicit conversion to `Iterable`, so one can call its methods on `Option` or pass `Option` as `Iterable`</li>
</ul>
<pre class="example">
for {
    x &lt;- List(1, 2, 3)
    y &lt;- Some('x')
} yield (x, y)
// Which desugars into
List(1,2,3).flatMap(x =&gt; Some('x').map(y =&gt; (x, y)))
</pre>
<ul class="org-ul">
<li>`List.flatMap`, however, requires a `TraversableOnce`, which `Option` is not. The compiler then looks for it in the `Option`'s companion object and finds the conversion to `Iterable`.</li>
</ul>
<ul class="org-ul">
<li>second, companion object of the expected type
<ul class="org-ul">
<li>the method `sorted` takes an implicit `Ordering`. In case of `List(1,2,3).sorted`, the compiler looks inside the `object Ordering` and finds an implicit `Ordering[Int]`.</li>
</ul></li>
<li>companion objects of superclasses are also looked into.</li>
</ul>
</div></li>
<li><a id="orgb2d459f"></a>implicit scopes of an argument's type<br  /><div class="outline-text-6" id="text-1-3-1-5-5">
<ul class="org-ul">
<li>by 'implicit scope' it's meant that all the given rules will be applied to the argument type (its companion object will be searched and so on.).</li>
</ul>
</div></li>
<li><a id="orgdfefca1"></a>implicit scope of type arguments<br  /><div class="outline-text-6" id="text-1-3-1-5-6">
<ul class="org-ul">
<li>the implicit scope is now the type arguments for given function</li>
</ul>
</div></li>
<li><a id="org5282a6e"></a>outer objects for nested types<br  /><div class="outline-text-6" id="text-1-3-1-5-7">
<pre class="example">
class A(val n: Int) {
    class B(val m: Int) { require(m &lt; n) }
}

object A {
    implicit def bToString(b: A#B) = "B: %d" format b.m
}

val a = new A(5)
val b = new a.B(3)
val s: String = b // s == "B: 3"
</pre>
</div></li></ol>
</div>
</div>
</div>
<div id="outline-container-org8604eb5" class="outline-3">
<h3 id="org8604eb5"><span class="section-number-3">1.4</span> Play</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-orgf5ec1ea" class="outline-4">
<h4 id="orgf5ec1ea"><span class="section-number-4">1.4.1</span> Play</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Using the `play` command, one can call the framework's functions (e.g.
`views.html.hello.render("Scala")` without having to run the server.
There is testability potential here, don't know yet how it all is wired up
though.
</p>
</div>

<div id="outline-container-org4ef440a" class="outline-5">
<h5 id="org4ef440a"><span class="section-number-5">1.4.1.1</span> Architecture</h5>
<div class="outline-text-5" id="text-1-4-1-1">
<p>
Based on the MVC model.
Play runs o JBoss Netty server (a non-blocking Java <span class="underline">New I/O</span> -type server).
Play apps can satisfy the constraints of a REST-style architecture.
Resources can be identified by URLs (through routes) and manipulated by HTTP
methods.
</p>
</div>

<ol class="org-ol"><li><a id="org9b927f5"></a>Ways of app design<br  /><ol class="org-ol"><li><a id="org2aa5dd2"></a><b>Database-centric</b>, where you start by defining the domain model with database entities and relations<br  /><div class="outline-text-7" id="text-1-4-1-1-1-1">
<ul class="org-ul">
<li>A common approach in enterprise environments, which often view the data model as a fundamental representation of a business domain that will outlive any single software application.</li>
</ul>
</div></li>
<li><a id="org326d5fc"></a><b>URL-centric</b>, where you start by defining the application's HTTP interface.<br  /><div class="outline-text-7" id="text-1-4-1-1-1-2">
<ul class="org-ul">
<li>Once you have a solid design, you can add a user-interface layer on top of this HTTP interface, and add a model that backs the HTTP resources.</li>
<li>You can create a consistent public API for your application that’s more stable than either the physical data model represented by its model classes, or the user interface generated by its view templates.</li>
<li>Focus is applied to <span class="underline">resource-oriented architecture</span>.</li>
</ul>
</div></li>
<li><a id="org2b74335"></a><b>UI-centric</b>, where you start by defining ways in which the user will interact with the application through its GUI.<br  /><div class="outline-text-7" id="text-1-4-1-1-1-3">
<ul class="org-ul">
<li>Mockups play a driving role.</li>
</ul>
</div></li></ol></li>
