Scala.org
***** Configuration

Play uses the [[https://github.com/typesafehub/config][Typesafe config library]].
It is possible to modularize the config through using multiple `.conf` files.
Create a `db-default.conf`, containing your default DB connection information
and then use `include "db-default.conf"` in your main `application.conf` file.

"Overwriting" a JSON object in the `application.conf` will effectively merge its
properties with the original one, instead of truly overwriting it.

The configuration file format is specified by the
[[https://github.com/typesafehub/config/blob/master/HOCON.md][Human-Optimized Config Object Notation]].

Configuration can be overriden from the CLI by using `run -Ddb.default.url=xxx`
for single values or `run -Dconfig.file=xxx/xxx` for the whole config file.
A relative path can be used for configs residing within the project, an absolute
one has to be provided for external configuration files.

The `play.api.Configuration` class provides the API for accessing config
options.

The `play.api.Application.configuration` is the configuration instance
for the current application.

Example:

#+begin_example
import play.api.Play.current
current.configuration.getString("db.default.url").map {
    databaseUrl => Logger.info(databaseUrl)
}

// You can also use getBoolean, getInt etc. - it's type-safe.
#+end_example

Configuration is structured hierarchically:

#+begin_example
// Returns an Option[Configuration] object.
current.configuration.getConfig("db.default").map {
    databaseConfiguration =>
        databaseConfiguration.getString("driver").map(Logger.info(_))
        databaseConfiguration.getString("url").map(Logger.info(_))
}
#+end_example

Using custom entries (e.g. `application.revision`):

#+begin_example
@import play.api.Play.current
<footer>
    Revision @current.configuration.getString("application.revision")
</footer>
#+end_example

***** Controller

Handles incoming HTTP requests and uses the model and view to build and return a
response.

Controller methods are called _actions_— Play’s architecture is in fact an MVC
variant called _action-based MVC_— so you can also think of a controller class
as a collection of action methods.

Group controllers by entity.

Don't define `var`s in controllers.
They should be stateless.

Each `Action` in Scala is a `Request[A] => Result` function, where `A` is the
request body type.

*Only import stuff from the* `play.api` *package*.


****** `play.api.mvc.Cookie`— An HTTP cookie: a small amount of data stored on the client and sent with subsequent requests.
****** `play.api.mvc.Request`— An HTTP request: HTTP method, URL, headers, body, and cookies
****** `play.api.mvc.RequestHeader`— Request metadata: a name-value pair
****** `play.api.mvc.Response`— An HTTP response, with headers and a body; wraps a Play Result
****** `play.api.mvc.ResponseHeader`—Response metadata: a name-value pair


****** `play.api.mvc.Action`—A function that processes a client Request and returns a Result
****** `play.api.mvc.Call`—An HTTP request: the combination of an HTTP method and a URL
****** `play.api.mvc.Content`—An HTTP response body with a particular content type
****** `play.api.mvc.Controller`—A generator for Action functions
****** `play.api.mvc.Flash`—A short-lived HTTP data scope used to set data for the next request
****** `play.api.mvc.Result`—The result of calling an Action to process a Request,
****** `play.api.mvc.Session`—A set of string keys and values, stored in an HTTP used to generate an HTTP response cookie

****** Action composition

To avoid code duplication, actions can be composed, since they are just
functions.
It's a decorator pattern.

Example:
#+begin_example
def list =
    Authenticated {
        Cached {
            Action {
                // Process request...
            }
        }
    }
#+end_example

`Authenticated` action is being passed to `Cached` as a parameter, which in turn
is being passed to the main `Action` that is to constitute the actual work to be
done.


****** Parameter Binding

Play uses binding concepts similar to those in ASP .NET MVC.

Will be discussed in chapter 7.

***** View

Combines dynamic model data with view templates.

If you have high performance requirements for serving static content, the best
approach is probably to use a cache or load balancer in front of Play,
instead of avoiding serving the files using Play in the first place.


***** Model

The application's domain-specific data and logic.
Communicates with storage through _Persistence API_.

It is beneficial to represent the model with Scala case classes.
They can be serialized by the Persistence API.

Play uses the the [[http://workwithplay.com/blog/2013/05/08/persist-data-with-anorm/][Anorm]] persistence library, but it's not a requirement.
Other ones, such as [[http://www.scalatra.org/2.2/guides/persistence/slick.html][Slick]], can be used.

****** Slick
[[http://www.scalatra.org/2.2/guides/persistence/slick.html][Slick]] is intended as the go-to Scala persistence API for relational DB access.
It acts as a kind of ORM by using built-in Scala language features.

Examples:

******* Mapping a database table to a `Product` DAO:
#+begin_example
object Product extends Table[(Long, String, String)]("products") {
    def ean = column[Long]("ean", O.PrimaryKey)
    def name = column[String]("name")
    def description = column[String]("description")

    // The projection that defines the columns in the "Table" definition.
    def * = ean ~ name ~ description
}
#+end_example
******* defining a query on a `Product` object:
#+begin_example
val products = for {
    product <- Product.sortBy(product => product.name.asc)
} yield (product)
#+end_example
To execute the query, you can use the query to generate a list of products in a
database session:
#+begin_example
val url = "jdbc:postgresql://localhost/slick?user=slick&password=slick"
Database.forURL(url, driver = "org.postgresql.Driver") withSession {
    val productList = products.list
}
#+end_example

**** Jobs

Akka is integrated, so long-running jobs can be scheduled for `Actor`s to
perform.
See the `simple-app` example for code.

**** Modularization

Play is modular - there are core modules, custom modules and 3rd party modules.

Examples of 3rd party modules:
***** _Deadbolt_ - role-based authorization
***** _Groovy templates_ - Alternative to Scala templates
***** _PDF_ - PDF output based on HTML templates
***** _Redis_ - Redis cache implementation
