Scala.html

<li><a id="org8cbb007"></a>Configuration<br  /><div class="outline-text-6" id="text-1-4-1-1-2">
<p>
Play uses the <a href="https://github.com/typesafehub/config">Typesafe config library</a>.
It is possible to modularize the config through using multiple `.conf` files.
Create a `db-default.conf`, containing your default DB connection information
and then use `include "db-default.conf"` in your main `application.conf` file.
</p>

<p>
"Overwriting" a JSON object in the `application.conf` will effectively merge its
properties with the original one, instead of truly overwriting it.
</p>

<p>
The configuration file format is specified by the
<a href="https://github.com/typesafehub/config/blob/master/HOCON.md">Human-Optimized Config Object Notation</a>.
</p>

<p>
Configuration can be overriden from the CLI by using `run -Ddb.default.url=xxx`
for single values or `run -Dconfig.file=xxx/xxx` for the whole config file.
A relative path can be used for configs residing within the project, an absolute
one has to be provided for external configuration files.
</p>

<p>
The `play.api.Configuration` class provides the API for accessing config
options.
</p>

<p>
The `play.api.Application.configuration` is the configuration instance
for the current application.
</p>

<p>
Example:
</p>

<pre class="example">
import play.api.Play.current
current.configuration.getString("db.default.url").map {
    databaseUrl =&gt; Logger.info(databaseUrl)
}

// You can also use getBoolean, getInt etc. - it's type-safe.
</pre>

<p>
Configuration is structured hierarchically:
</p>

<pre class="example">
// Returns an Option[Configuration] object.
current.configuration.getConfig("db.default").map {
    databaseConfiguration =&gt;
        databaseConfiguration.getString("driver").map(Logger.info(_))
        databaseConfiguration.getString("url").map(Logger.info(_))
}
</pre>

<p>
Using custom entries (e.g. `application.revision`):
</p>

<pre class="example">
@import play.api.Play.current
&lt;footer&gt;
    Revision @current.configuration.getString("application.revision")
&lt;/footer&gt;
</pre>
</div></li>

<li><a id="org6d576aa"></a>Controller<br  /><div class="outline-text-6" id="text-1-4-1-1-3">
<p>
Handles incoming HTTP requests and uses the model and view to build and return a
response.
</p>

<p>
Controller methods are called _actions_— Play’s architecture is in fact an MVC
variant called _action-based MVC_— so you can also think of a controller class
as a collection of action methods.
</p>

<p>
Group controllers by entity.
</p>

<p>
Don't define `var`s in controllers.
They should be stateless.
</p>

<p>
Each `Action` in Scala is a `Request[A] =&gt; Result` function, where `A` is the
request body type.
</p>

<p>
<b>Only import stuff from the</b> `play.api` <b>package</b>.
</p>
</div>


<ol class="org-ol"><li><a id="org0e0c840"></a>`play.api.mvc.Cookie`— An HTTP cookie: a small amount of data stored on the client and sent with subsequent requests.<br  /></li>
<li><a id="org6443eba"></a>`play.api.mvc.Request`— An HTTP request: HTTP method, URL, headers, body, and cookies<br  /></li>
<li><a id="org5a77c81"></a>`play.api.mvc.RequestHeader`— Request metadata: a name-value pair<br  /></li>
<li><a id="orgf596f7c"></a>`play.api.mvc.Response`— An HTTP response, with headers and a body; wraps a Play Result<br  /></li>
<li><a id="org6d8a28c"></a>`play.api.mvc.ResponseHeader`—Response metadata: a name-value pair<br  /></li>


<li><a id="org5923da1"></a>`play.api.mvc.Action`—A function that processes a client Request and returns a Result<br  /></li>
<li><a id="org2c667e7"></a>`play.api.mvc.Call`—An HTTP request: the combination of an HTTP method and a URL<br  /></li>
<li><a id="org253bc78"></a>`play.api.mvc.Content`—An HTTP response body with a particular content type<br  /></li>
<li><a id="org43148fb"></a>`play.api.mvc.Controller`—A generator for Action functions<br  /></li>
<li><a id="orgce80106"></a>`play.api.mvc.Flash`—A short-lived HTTP data scope used to set data for the next request<br  /></li>
<li><a id="orgc91d96e"></a>`play.api.mvc.Result`—The result of calling an Action to process a Request,<br  /></li>
<li><a id="org0b4ca7d"></a>`play.api.mvc.Session`—A set of string keys and values, stored in an HTTP used to generate an HTTP response cookie<br  /></li>

<li><a id="org24d50f8"></a>Action composition<br  /><div class="outline-text-7" id="text-1-4-1-1-3-13">
<p>
To avoid code duplication, actions can be composed, since they are just
functions.
It's a decorator pattern.
</p>

<p>
Example:
</p>
<pre class="example">
def list =
    Authenticated {
        Cached {
            Action {
                // Process request...
            }
        }
    }
</pre>

<p>
`Authenticated` action is being passed to `Cached` as a parameter, which in turn
is being passed to the main `Action` that is to constitute the actual work to be
done.
</p>
</div></li>


<li><a id="org1922656"></a>Parameter Binding<br  /><div class="outline-text-7" id="text-1-4-1-1-3-14">
<p>
Play uses binding concepts similar to those in ASP .NET MVC.
</p>

<p>
Will be discussed in chapter 7.
</p>
</div></li></ol></li>

<li><a id="org8f03bd7"></a>View<br  /><div class="outline-text-6" id="text-1-4-1-1-4">
<p>
Combines dynamic model data with view templates.
</p>

<p>
If you have high performance requirements for serving static content, the best
approach is probably to use a cache or load balancer in front of Play,
instead of avoiding serving the files using Play in the first place.
</p>
</div></li>


<li><a id="org65c2ea8"></a>Model<br  /><div class="outline-text-6" id="text-1-4-1-1-5">
<p>
The application's domain-specific data and logic.
Communicates with storage through <span class="underline">Persistence API</span>.
</p>

<p>
It is beneficial to represent the model with Scala case classes.
They can be serialized by the Persistence API.
</p>

<p>
Play uses the the <a href="http://workwithplay.com/blog/2013/05/08/persist-data-with-anorm/">Anorm</a> persistence library, but it's not a requirement.
Other ones, such as <a href="http://www.scalatra.org/2.2/guides/persistence/slick.html">Slick</a>, can be used.
</p>
</div>

<ol class="org-ol"><li><a id="org86ebb29"></a>Slick<br  /><div class="outline-text-7" id="text-1-4-1-1-5-1">
<p>
<a href="http://www.scalatra.org/2.2/guides/persistence/slick.html">Slick</a> is intended as the go-to Scala persistence API for relational DB access.
It acts as a kind of ORM by using built-in Scala language features.
</p>

<p>
Examples:
</p>
</div>

<ol class="org-ol"><li><a id="orga4b98f2"></a>Mapping a database table to a `Product` DAO:<br  /><div class="outline-text-8" id="text-1-4-1-1-5-1-1">
<pre class="example">
object Product extends Table[(Long, String, String)]("products") {
    def ean = column[Long]("ean", O.PrimaryKey)
    def name = column[String]("name")
    def description = column[String]("description")

    // The projection that defines the columns in the "Table" definition.
    def * = ean ~ name ~ description
}
</pre>
</div></li>
<li><a id="org795196a"></a>defining a query on a `Product` object:<br  /><div class="outline-text-8" id="text-1-4-1-1-5-1-2">
<pre class="example">
val products = for {
    product &lt;- Product.sortBy(product =&gt; product.name.asc)
} yield (product)
</pre>
<p>
To execute the query, you can use the query to generate a list of products in a
database session:
</p>
<pre class="example">
val url = "jdbc:postgresql://localhost/slick?user=slick&amp;password=slick"
Database.forURL(url, driver = "org.postgresql.Driver") withSession {
    val productList = products.list
}
</pre>
</div></li></ol></li></ol></li></ol>
</div>

<div id="outline-container-org9757081" class="outline-5">
<h5 id="org9757081"><span class="section-number-5">1.4.1.2</span> Jobs</h5>
<div class="outline-text-5" id="text-1-4-1-2">
<p>
Akka is integrated, so long-running jobs can be scheduled for `Actor`s to
perform.
See the `simple-app` example for code.
</p>
</div>
</div>

<div id="outline-container-org5aacfc7" class="outline-5">
<h5 id="org5aacfc7"><span class="section-number-5">1.4.1.3</span> Modularization</h5>
<div class="outline-text-5" id="text-1-4-1-3">
<p>
Play is modular - there are core modules, custom modules and 3rd party modules.
</p>

<p>
Examples of 3rd party modules:
</p>
</div>
<ol class="org-ol"><li><a id="org876a8c5"></a><span class="underline">Deadbolt</span> - role-based authorization<br  /></li>
<li><a id="orga17f327"></a><span class="underline">Groovy templates</span> - Alternative to Scala templates<br  /></li>
<li><a id="org0a62002"></a><span class="underline">PDF</span> - PDF output based on HTML templates<br  /></li>
<li><a id="org973bb62"></a><span class="underline">Redis</span> - Redis cache implementation<br  /></li>
