Scala.org
***** _Sass_ - Sass compilation support

The main Play application should be oriented on the domain model and business
logic.
Everything else should be extracted to custom modules. (for SRP, testability,
maintainability etc.)
i
*Example: adding commenting functionality to an application for managing product stocks in a warehouse network.*
This functionality (as well as the related data) is somewhat independent from
the domain and has a public interface (UI / API) that's separate from the rest
of the app.

Related features:
***** Persistent model classes for comment storage
***** A UI on the products page for CRUDing comments
***** A controller, providing an HTTP API for adding and viewing comments

For that, you'd create a new, separate `comments` module, add it as an app
dependency and finally move the relevant code to the module. This assumes that
you have already coded up the comments in the main app and want to refactor.
You can also go module-first, always creating separate modules for different
functionalities and adding to the main application only when absolutely
necessary.

***** How to connect modules to the domain

E.g. the obvious model design for product comments includes a direct reference
from a comment to a product it relates to.
Such a design would of course make the comments module dependent on the domain
model, a trait you strive to avoid.
The solution is to make a weaker link from comments to products, using the app's
HTTP API. Instead of linking comments directly to the products model, you can
link comments to an arbitrary application URL, such as a product's details page
URL.

As long as you identify products by clean, stateless URLs for their details
pages, it's enough to comment on a page instead of a product.

A similar issue arises in the controller layer when you want to acquire the
comments for a given product to render them inline within the view template.
The solution here is to load them separately via AJAX. This AJAX request would
call the comments controller and receive a JSON response.

    A good rule of thumb is that you can use a separate module whenever possible
    for functionality that’s orthogonal to your application’s model.
    Code that doesn’t depend on your model can usually be extracted to a
    separate independent module, but code that uses your model shouldn’t be in a
    module because then that module would depend on your application and not be
    reusable.

If you want to extract functionality that appears to depend on the model,
consider whether there’s a way to avoid this dependency, or make it a loose
coupling by using an external reference like the page URL rather than a model
reference like a product ID.

A module can also include a plugin, which is a class that extends
`play.api.Plugin` in order to intercept application startup and shutdown events.
Plugins aren’t specific to modules—a Play application can also include a plugin—
but they’re especially useful for modules that enhance Play.

**** HTTP API design
***** Routing

`GET /products controllers.Products.list(page: Int ?= 1)` syntax is used for
optional parameters.

`GET /products controllers.Products.list(page: Int = 1)` syntax is used for
fixed parameter values that are not specified in the URL.

*To support slashes in URL parameters*, use:
`GET /photo/*file controllers.Media.photo(file: String)` (notice the asterisk).

*To alias routes*, use:
#+begin_example
GET /product/$ean<\d{13}> controllers.Products.details(ean: Long)
GET /product/:alias controllers.Products.alias(alias: String)
#+end_example

*Reverse routing* is nothing more than having Scala objects built based on the
 route configuration file.
They serve to provide maintainable URL references that reflect any changes in
the configuration.
Each URL of your application shoul optimally occur only once - in the route
config file.

Reverse controllers are available in the `controllers.routes` class, generated
by Play.

***** Response handling

You can add custom headers to the response.

Example:
#+begin_example
val url = routes.Products.details(product.ean).url
// /HTTP 201 wuth a 'Location' header
Created.withHeaders(LOCATION -> url)
#+end_example

Response types can be overriden, using values from the
`play.api.http.ContentTypes` trait, which `Controller` extends.

Example:
#+begin_example
Ok("""{ "status": "success" }""").as(JSON)
#+end_example

****** JSON

JSON responses are created from `Map` objects.

Example:
#+begin_example
def json = Action {
    import play.api.libs.json.Json
    val success = Map("status" -> "success")
    val json = Json.toJson(success)
    Ok(json)
}
#+end_example

****** Binary data

Creating a binary response is similar to JSON or XML - you just need to add the
content type yourself.

****** Session

Session data is a `Map[String,String]` which is implemented as an HTTP cookie.

    *Important note:* 
    The canonical use case for session cookies is to identify the currently
    authenticated user. In fact, it’s reasonable to argue that if you can 
    identify the current user using a session cookie, then that should be the
    only thing you use cookies for, because you can load user-specific data from 
    a Persistent data model instead.

Example usage:
#+begin_example
Ok(results).withSession(
    request.session + ("search.previous" -> query)
)

// Then for another request...
val search = request.session.get("search.previous")

// Clearing a session value
Ok(results).withSession(
    request.session - "search.previous"
)
#+end_example

****** Flash data

A specific, transient session use case.
Flash data can be used e.g. to display success/error messages.

To use the _flash scope_ provided by Play:
#+begin_example
// set the flash data
Redirect(routes.Products.flash()).flashing(
    "info" -> "Product deleted!"
)

// (somewhere else) acquire the data
val message = request.flash("info")
#+end_example

An `(implicit flash: Flash)` parameter can also be used in a view template to
have implicit access to the _flash scope_.



