Scala.html
<li><a id="org55cdac9"></a><span class="underline">Sass</span> - Sass compilation support<br  /><div class="outline-text-6" id="text-1-4-1-3-5">
<p>
The main Play application should be oriented on the domain model and business
logic.
Everything else should be extracted to custom modules. (for SRP, testability,
maintainability etc.)
i
<b>Example: adding commenting functionality to an application for managing product stocks in a warehouse network.</b>
This functionality (as well as the related data) is somewhat independent from
the domain and has a public interface (UI / API) that's separate from the rest
of the app.
</p>

<p>
Related features:
</p>
</div></li>
<li><a id="org6243c9e"></a>Persistent model classes for comment storage<br  /></li>
<li><a id="org8e0ead8"></a>A UI on the products page for CRUDing comments<br  /></li>
<li><a id="org27c28cf"></a>A controller, providing an HTTP API for adding and viewing comments<br  /><div class="outline-text-6" id="text-1-4-1-3-8">
<p>
For that, you'd create a new, separate `comments` module, add it as an app
dependency and finally move the relevant code to the module. This assumes that
you have already coded up the comments in the main app and want to refactor.
You can also go module-first, always creating separate modules for different
functionalities and adding to the main application only when absolutely
necessary.
</p>
</div></li>

<li><a id="org208c021"></a>How to connect modules to the domain<br  /><div class="outline-text-6" id="text-1-4-1-3-9">
<p>
E.g. the obvious model design for product comments includes a direct reference
from a comment to a product it relates to.
Such a design would of course make the comments module dependent on the domain
model, a trait you strive to avoid.
The solution is to make a weaker link from comments to products, using the app's
HTTP API. Instead of linking comments directly to the products model, you can
link comments to an arbitrary application URL, such as a product's details page
URL.
</p>

<p>
As long as you identify products by clean, stateless URLs for their details
pages, it's enough to comment on a page instead of a product.
</p>

<p>
A similar issue arises in the controller layer when you want to acquire the
comments for a given product to render them inline within the view template.
The solution here is to load them separately via AJAX. This AJAX request would
call the comments controller and receive a JSON response.
</p>

<p>
A good rule of thumb is that you can use a separate module whenever possible
for functionality that’s orthogonal to your application’s model.
Code that doesn’t depend on your model can usually be extracted to a
separate independent module, but code that uses your model shouldn’t be in a
module because then that module would depend on your application and not be
reusable.
</p>

<p>
If you want to extract functionality that appears to depend on the model,
consider whether there’s a way to avoid this dependency, or make it a loose
coupling by using an external reference like the page URL rather than a model
reference like a product ID.
</p>

<p>
A module can also include a plugin, which is a class that extends
`play.api.Plugin` in order to intercept application startup and shutdown events.
Plugins aren’t specific to modules—a Play application can also include a plugin—
but they’re especially useful for modules that enhance Play.
</p>
</div></li></ol>
</div>

<div id="outline-container-org03219ec" class="outline-5">
<h5 id="org03219ec"><span class="section-number-5">1.4.1.4</span> HTTP API design</h5>
<div class="outline-text-5" id="text-1-4-1-4">
</div><ol class="org-ol"><li><a id="org2d5c4cf"></a>Routing<br  /><div class="outline-text-6" id="text-1-4-1-4-1">
<p>
`GET /products controllers.Products.list(page: Int ?= 1)` syntax is used for
optional parameters.
</p>

<p>
`GET /products controllers.Products.list(page: Int = 1)` syntax is used for
fixed parameter values that are not specified in the URL.
</p>

<p>
<b>To support slashes in URL parameters</b>, use:
`GET /photo/*file controllers.Media.photo(file: String)` (notice the asterisk).
</p>

<p>
<b>To alias routes</b>, use:
</p>
<pre class="example">
GET /product/$ean&lt;\d{13}&gt; controllers.Products.details(ean: Long)
GET /product/:alias controllers.Products.alias(alias: String)
</pre>

<p>
<b>Reverse routing</b> is nothing more than having Scala objects built based on the
 route configuration file.
They serve to provide maintainable URL references that reflect any changes in
the configuration.
Each URL of your application shoul optimally occur only once - in the route
config file.
</p>

<p>
Reverse controllers are available in the `controllers.routes` class, generated
by Play.
</p>
</div></li>

<li><a id="orgde4e6fd"></a>Response handling<br  /><div class="outline-text-6" id="text-1-4-1-4-2">
<p>
You can add custom headers to the response.
</p>

<p>
Example:
</p>
<pre class="example">
val url = routes.Products.details(product.ean).url
// /HTTP 201 wuth a 'Location' header
Created.withHeaders(LOCATION -&gt; url)
</pre>

<p>
Response types can be overriden, using values from the
`play.api.http.ContentTypes` trait, which `Controller` extends.
</p>

<p>
Example:
</p>
<pre class="example">
Ok("""{ "status": "success" }""").as(JSON)
</pre>
</div>

<ol class="org-ol"><li><a id="org6268e85"></a>JSON<br  /><div class="outline-text-7" id="text-1-4-1-4-2-1">
<p>
JSON responses are created from `Map` objects.
</p>

<p>
Example:
</p>
<pre class="example">
def json = Action {
    import play.api.libs.json.Json
    val success = Map("status" -&gt; "success")
    val json = Json.toJson(success)
    Ok(json)
}
</pre>
</div></li>

<li><a id="org53c0b8f"></a>Binary data<br  /><div class="outline-text-7" id="text-1-4-1-4-2-2">
<p>
Creating a binary response is similar to JSON or XML - you just need to add the
content type yourself.
</p>
</div></li>

<li><a id="orgcdbff34"></a>Session<br  /><div class="outline-text-7" id="text-1-4-1-4-2-3">
<p>
Session data is a `Map[String,String]` which is implemented as an HTTP cookie.
</p>

<p>
<b>Important note:</b> 
The canonical use case for session cookies is to identify the currently
authenticated user. In fact, it’s reasonable to argue that if you can 
identify the current user using a session cookie, then that should be the
only thing you use cookies for, because you can load user-specific data from 
a Persistent data model instead.
</p>

<p>
Example usage:
</p>
<pre class="example">
Ok(results).withSession(
    request.session + ("search.previous" -&gt; query)
)

// Then for another request...
val search = request.session.get("search.previous")

// Clearing a session value
Ok(results).withSession(
    request.session - "search.previous"
)
</pre>
</div></li>

<li><a id="orgd143133"></a>Flash data<br  /><div class="outline-text-7" id="text-1-4-1-4-2-4">
<p>
A specific, transient session use case.
Flash data can be used e.g. to display success/error messages.
</p>

<p>
To use the <span class="underline">flash scope</span> provided by Play:
</p>
<pre class="example">
// set the flash data
Redirect(routes.Products.flash()).flashing(
    "info" -&gt; "Product deleted!"
)

// (somewhere else) acquire the data
val message = request.flash("info")
</pre>

<p>
An `(implicit flash: Flash)` parameter can also be used in a view template to
have implicit access to the <span class="underline">flash scope</span>.
</p>
</div></li></ol></li></ol>
</div>
</div>
</div>
