Scala.html



<div id="outline-container-org527774d" class="outline-3">
<h3 id="org527774d"><span class="section-number-3">1.5</span> ScalaTest</h3>
<div class="outline-text-3" id="text-1-5">
<p>
#= ScalaTest =
</p>

<p>
Read the [ScalaDoc](<a href="http://www.scalatest.org/scaladoc">http://www.scalatest.org/scaladoc</a>) for ScalaTest - there is a lot of info there, much of it not covered in the main guide.
</p>

<p>
`trait Checkpoints` aggregates assertion errors, allowing you to have all the erro messages instead of failing the spec on the first faield test.
</p>

<p>
During the presentation (JUG), the followign opinion was voiced again:
</p>

<p>
&gt; If you're writing Scala and have to use mocks, that's a code smell.
</p>

<p>
This pertains to maintaing purity in tested functions.
</p>

<p>
`scalatest.fixtures` allows to create data fictures for test which are then injected into `in` blocks.
You need to extend `fixtures.FlatSpec` instead of just `scalatest.FlatSpec`.
</p>
<pre class="example">
type FixtureParam = yourtype
def withFixture(test: someTestType): Outcome
</pre>

<p>
`trait PatienceConfiguration` allows defining the `timeout` and `interval` values for asynchronous code executed within tests.
This is useful whenutilizing the `whenReady` function (similar to `Await` but async).
Another use case is the `eventually { &#x2026; }` construct, which tries to execute the code block every `interval` ms until `timeout` value has been reached.
</p>

<p>
Test tagging:
</p>
<pre class="example">
it should "do something" taggedAs IntegrationTest in {
    ...
}
</pre>

<p>
This allows running only a specifiedset of tests - can be used through test configurations.
</p>

<p>
Object property checking:
</p>
<pre class="example">
person should have (
    'id(123),
    'name("test"),
    ...
)
</pre>

<p>
This was compared to a <a href="#org4d84591">1.5.1</a>.
</p>
</div>


<div id="outline-container-org4d84591" class="outline-4">
<h4 id="org4d84591"><span class="section-number-4">1.5.1</span> lens</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
#= Lens =
</p>

<p>
This topic should be followed up on when you're more qualified to reason about these topics.
</p>

<p>
SPJ presentation:
<a href="https://pdlvimeocdn-a.akamaihd.net/11073/941/195814777.mp4?token2=1426025400_f1ce041424a36f8be91eb40b5a56dbca&amp;aksessionid=6464f9f872ab29c5">https://pdlvimeocdn-a.akamaihd.net/11073/941/195814777.mp4?token2=1426025400_f1ce041424a36f8be91eb40b5a56dbca&amp;aksessionid=6464f9f872ab29c5</a>
</p>

<p>
Lenses in Scalaz:
<a href="http://eed3si9n.com/learning-scalaz/Lens.html">http://eed3si9n.com/learning-scalaz/Lens.html</a>
</p>


<p>
In functional programming, lenses are a construct that allow functional, composable access to data structures.
They were called "jQuery for data types".
A simple example of a lens would be a function giving you access to the `minutes` portion of a `DateTime` structure.
</p>

<p>
A lens is a first-class value with a type of `Lens' s a`, where `s` is the container type and `a` is the <b>focus</b> type.
</p>

<p>
Lens composition:
</p>
<pre class="example">
composeL :: Lens' s1 s2
         -&gt; Lens' s2 a
         -&gt; Lens' s1 a
</pre>

<p>
Haskell already supports a similar concept through nested records, but the code for that is quite cumbersome.
</p>

<p>
More concrete example:
</p>
<pre class="example">
data Person = P { name :: String
                , addr :: Address
                , salary :: Int }
data Address = A { road :: String
                 , city :: String
                 , postcode :: String }

setPostcode :: String -&gt; Person -&gt; Person
setPostcode pc p =
    set (laddr `composeL` lpostcode) pc p
}
</pre>

<p>
We want to have a lens for each field:
</p>
<pre class="example">
data Person = P { name :: String
                , addr :: Address
                , salary :: Int }
lname :: Lens' Person String
laddr :: Lens' Person Address
lsalary :: Lens' Person Int
</pre>

<p>
as well as means to use it for getting or updating values:
</p>
<pre class="example">
view :: Lens' s a -&gt; s -&gt; a
view :: Lens' s a -&gt; a -&gt; s -&gt; s
</pre>

<p>
and the aforementioned way of composing them:
</p>

<pre class="example">
somposeL :: Lens' s1 s2 -&gt; Lens' s2 a -&gt; Lens' s1 a
</pre>
</div>
</div>
</div>
<div id="outline-container-org8ec6497" class="outline-3">
<h3 id="org8ec6497"><span class="section-number-3">1.6</span> Substitution-related</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-org52655d3" class="outline-4">
<h4 id="org52655d3"><span class="section-number-4">1.6.1</span> Substitution-related</h4>
<div class="outline-text-4" id="text-1-6-1">
</div><div id="outline-container-org35020dd" class="outline-5">
<h5 id="org35020dd"><span class="section-number-5">1.6.1.1</span> Substitution</h5>
<div class="outline-text-5" id="text-1-6-1-1">
<p>
Substitution in Scala by default is done as follows:
</p>
</div>
<ol class="org-ol"><li><a id="org5be3082"></a>Pick the left-most operation.<br  /></li>
<li><a id="orga36efd4"></a>Evaluate its operands.<br  /></li>
<li><a id="org405414a"></a>Apply the operator to the operand values.<br  /><div class="outline-text-6" id="text-1-6-1-1-3">
<p>
The process of stepwise simplification of expressions is called <span class="underline">reduction</span>.
</p>

<p>
A function also plays the role of an operator.
</p>

<p>
Precondition for the following sections:
</p>

<pre class="example">
scala&gt; def square(x: Double) = x * x
square: (Double)Double

scala&gt; def sumOfSquares(x: Double, y: Double) = square(x) + square(y)
sumOfSquares: (Double,Double)Double
</pre>
</div></li></ol>
</div>

<div id="outline-container-orgfa1e0f5" class="outline-5">
<h5 id="orgfa1e0f5"><span class="section-number-5">1.6.1.2</span> Call-by-value</h5>
<div class="outline-text-5" id="text-1-6-1-2">
<p>
This is a standard way of doing reduction by the interpreter.
</p>
</div>
<ol class="org-ol"><li><a id="org99a9a9a"></a>The arguments of a function are evaluated (LTR).<br  /></li>
<li><a id="orgc8c8f83"></a>Function application is replaced by the function's RHS.<br  /></li>
<li><a id="orgadeb6c6"></a>All formal parameters of the function are replaced by their corresponding actual arguments.<br  /><div class="outline-text-6" id="text-1-6-1-2-3">
<pre class="example">
  sumOfSquares(3, 2+2)
→ sumOfSquares(3, 4)
→ square(3) + square(4)
→ 3 * 3 + square(4)
→ 9 + square(4)
→ 9 + 4 * 4
→ 9 + 16
→ 25
</pre>
</div></li></ol>
</div>

<div id="outline-container-org3d51ee4" class="outline-5">
<h5 id="org3d51ee4"><span class="section-number-5">1.6.1.3</span> Call-by-name</h5>
<div class="outline-text-5" id="text-1-6-1-3">
<p>
An alternative way of doing reduction
</p>
</div>
<ol class="org-ol"><li><a id="org8fc8511"></a>Function application is replaced by the function's RHS.<br  /></li>
<li><a id="org085583c"></a>The arguments of a function are evaluated (LTR).<br  /></li>
<li><a id="orgbca5fcd"></a>All formal parameters of the function are replaced by their corresponding actual arguments.<br  /><div class="outline-text-6" id="text-1-6-1-3-3">
<pre class="example">
  sumOfSquares(3, 2+2)
→ square(3) + square(2+2)
→ 3 * 3 + square(2+2)
→ 9 + square(2+2)
→ 9 + (2+2) * (2+2)
→ 9 + 4 * (2+2)
→ 9 + 4 * 4
→ 9 + 16
→ 25
</pre>

<p>
Scala uses call-by-value by default, but it switches to call-by-name evaluation
if the parameter type is preceded by `=&gt;`.
</p>
</div></li></ol>
</div>
</div>
</div>
<div id="outline-container-org1397616" class="outline-3">
<h3 id="org1397616"><span class="section-number-3">1.7</span> Traits</h3>
<div class="outline-text-3" id="text-1-7">
<p>
#= Scala - traits =
</p>

<p>
Instead of abstract class one also often uses the keyword `trait` in Scala.
Traits are abstract classes that are meant to be added to some other class.
This might be because a trait adds some methods or fields to an unknown parent
class.
For instance, a trait Bordered might be used to add a border to a various
graphical components.
Another usage scenario is where the trait collects signatures of some 
functionality provided by different classes, much in the way a Java interface 
would work.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
